; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	spectrograph0 - mode
	spectrograph3 - mode
	image6 - mode
	spectrograph2 - mode
	image7 - mode
	spectrograph4 - mode
	spectrograph5 - mode
	spectrograph1 - mode
	GroundStation2 - direction
	GroundStation4 - direction
	Star5 - direction
	Star3 - direction
	GroundStation1 - direction
	Star0 - direction
	Phenomenon6 - direction
	Planet7 - direction
	Star8 - direction
	Star9 - direction
	Phenomenon10 - direction
	Planet11 - direction
)
(:init
	(supports instrument0 spectrograph1)
	(supports instrument0 spectrograph0)
	(calibration_target instrument0 Star3)
	(supports instrument1 image7)
	(supports instrument1 spectrograph5)
	(calibration_target instrument1 Star0)
	(calibration_target instrument1 Star3)
	(supports instrument2 spectrograph1)
	(supports instrument2 spectrograph0)
	(supports instrument2 image6)
	(calibration_target instrument2 GroundStation1)
	(calibration_target instrument2 Star0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet7)
	(supports instrument3 image7)
	(supports instrument3 spectrograph2)
	(calibration_target instrument3 Star0)
	(calibration_target instrument3 Star5)
	(supports instrument4 spectrograph1)
	(supports instrument4 spectrograph0)
	(calibration_target instrument4 GroundStation1)
	(calibration_target instrument4 Star3)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon6)
	(supports instrument5 spectrograph5)
	(supports instrument5 spectrograph4)
	(supports instrument5 image6)
	(supports instrument5 spectrograph3)
	(calibration_target instrument5 Star0)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star5)
)
(:goal (and
	(have_image Phenomenon6 spectrograph5)
	(have_image Planet7 image6)
	(have_image Planet7 spectrograph1)
	(have_image Star8 spectrograph2)
	(have_image Star9 spectrograph3)
	(have_image Star9 spectrograph4)
	(have_image Phenomenon10 spectrograph4)
	(have_image Planet11 spectrograph3)
))

)

; plan
1. (turn_to satellite2 star0 star5)
   deleted: (pointing satellite2 star5)
   added: (pointing satellite2 star0)
   goals met: 0 of 8
2. (switch_on instrument5 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument5)
   goals met: 0 of 8
3. (calibrate satellite2 instrument5 star0)
   added: (calibrated instrument5)
   goals met: 0 of 8
4. (turn_to satellite2 phenomenon10 star0)
   deleted: (pointing satellite2 star0)
   added: (pointing satellite2 phenomenon10)
   goals met: 0 of 8
5. (turn_to satellite1 star0 phenomenon6)
   deleted: (pointing satellite1 phenomenon6)
   added: (pointing satellite1 star0)
   goals met: 0 of 8
6. (turn_to satellite0 groundstation1 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 groundstation1)
   goals met: 0 of 8
7. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 0 of 8
8. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 0 of 8
9. (calibrate satellite1 instrument3 star0)
   added: (calibrated instrument3)
   goals met: 0 of 8
10. (calibrate satellite0 instrument2 groundstation1)
   added: (calibrated instrument2)
   goals met: 0 of 8
11. (take_image satellite2 phenomenon10 instrument5 spectrograph4)
   added: (have_image phenomenon10 spectrograph4)
   goals met: 1 of 8
12. (turn_to satellite0 planet7 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 planet7)
   goals met: 1 of 8
13. (take_image satellite0 planet7 instrument2 image6)
   added: (have_image planet7 image6)
   goals met: 2 of 8
14. (take_image satellite0 planet7 instrument2 spectrograph1)
   added: (have_image planet7 spectrograph1)
   goals met: 3 of 8
15. (turn_to satellite1 star8 star0)
   deleted: (pointing satellite1 star0)
   added: (pointing satellite1 star8)
   goals met: 3 of 8
16. (take_image satellite1 star8 instrument3 spectrograph2)
   added: (have_image star8 spectrograph2)
   goals met: 4 of 8
17. (turn_to satellite2 phenomenon6 phenomenon10)
   deleted: (pointing satellite2 phenomenon10)
   added: (pointing satellite2 phenomenon6)
   goals met: 4 of 8
18. (take_image satellite2 phenomenon6 instrument5 spectrograph5)
   added: (have_image phenomenon6 spectrograph5)
   goals met: 5 of 8
19. (turn_to satellite2 planet11 phenomenon6)
   deleted: (pointing satellite2 phenomenon6)
   added: (pointing satellite2 planet11)
   goals met: 5 of 8
20. (take_image satellite2 planet11 instrument5 spectrograph3)
   added: (have_image planet11 spectrograph3)
   goals met: 6 of 8
21. (turn_to satellite2 star9 planet11)
   deleted: (pointing satellite2 planet11)
   added: (pointing satellite2 star9)
   goals met: 6 of 8
22. (take_image satellite2 star9 instrument5 spectrograph3)
   added: (have_image star9 spectrograph3)
   goals met: 7 of 8
23. (take_image satellite2 star9 instrument5 spectrograph4)
   added: (have_image star9 spectrograph4)
   goals met: 8 of 8
